app/views/books/index.html.erb

					<td><!-- コメント機能 件数表示 -->
						<%= book.book_comments.count %>件コメント
---
SELECT "books".* FROM "books"
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]