app/controllers/book_comments_controller.rb

  def create
    @book = Book.find(params[:book_id])
    @comment = current_user.book_comments.new(book_comment_params)
    @comment.book_id = @book.id
    if @comment.save
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "book_comments" ("user_id", "book_id", "comment", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["book_id", 1], ["comment", "comment test 1"], ["created_at", "2020-09-03 13:56:08.709657"], ["updated_at", "2020-09-03 13:56:08.709657"]]

  def destroy
    @comment = BookComment.find_by(params[:id])
    @comment.destroy
---
SELECT  "book_comments".* FROM "book_comments" WHERE "book_comments"."id" IS NULL AND "book_comments"."book_id" = ? LIMIT ?  [["book_id", 1], ["LIMIT", 1]]
DELETE FROM "book_comments" WHERE "book_comments"."id" = ?  [["id", 1]]